In [1]:
import numpy as np 
import pandas as pd

In [3]:
arr = np.array([4,8,-3,1])
Q1 = pd.Series(arr)
Q1

0    4
1    8
2   -3
3    1
dtype: int64

In [4]:
Q2 = pd.Series(arr, index=['a', 'b', 'c', 'd'])
Q2

a    4
b    8
c   -3
d    1
dtype: int64

In [5]:
Q3 = Q2['c']
Q3

-3

In [6]:
Q4 = Q2.copy()
Q4['c'] = 0
Q4

a    4
b    8
c    0
d    1
dtype: int64

In [7]:
Q5 = Q4[Q4 > 2]
Q5
Q5

a    4
b    8
dtype: int64

In [8]:
states = {'Wyoming': 581000,'Vermont': 623000,'DC': 714000,
          'Alaska': 724000,'North Dakota': 770000}

Q6 = pd.Series(states)
Q6

Wyoming         581000
Vermont         623000
DC              714000
Alaska          724000
North Dakota    770000
dtype: int64

In [10]:
states2 = ['Alaska','DC','North Dakota','South Dakota','Wyoming']
Q7 = pd.Series(states, index=states2)
Q7

Alaska          724000.0
DC              714000.0
North Dakota    770000.0
South Dakota         NaN
Wyoming         581000.0
dtype: float64

In [11]:
Q8 = Q6 + Q7
Q8

Alaska          1448000.0
DC              1428000.0
North Dakota    1540000.0
South Dakota          NaN
Vermont               NaN
Wyoming         1162000.0
dtype: float64

In [12]:
Q9 = Q8.copy()
Q9 = Q9.dropna()
Q9.name = 'population'
Q9.index.name = 'state'
Q9

state
Alaska          1448000.0
DC              1428000.0
North Dakota    1540000.0
Wyoming         1162000.0
Name: population, dtype: float64

In [13]:
data = {'book':['The Way of Kings','A Game of Thrones','The Hobbit',
                "Harry Potter and the Sorcerer's Stone",'The Lion, the Witch, and the Wardrobe'],
        'year_published': [2010,1996,1937,1997,1950],
        'amazon_rating': [5,4.5,5,5,5]}

Q10 = pd.DataFrame(data)
Q10

                                    book  year_published  amazon_rating
0                       The Way of Kings            2010            5.0
1                      A Game of Thrones            1996            4.5
2                             The Hobbit            1937            5.0
3  Harry Potter and the Sorcerer's Stone            1997            5.0
4  The Lion, the Witch, and the Wardrobe            1950            5.0

In [14]:
Q11 = Q10.copy()

Q11['copies_owned'] = 1
Q11

,book,year_published,amazon_rating,copies_owned
0,The Way of Kings,2010,5.0,1
1,A Game of Thrones,1996,4.5,1
2,The Hobbit,1937,5.0,1
3,Harry Potter and the Sorcerer's Stone,1997,5.0,1
4,"The Lion, the Witch, and the Wardrobe",1950,5.0,1

In [15]:
Q12 = Q11.copy()
Q12 = Q12.drop(columns = 'copies_owned')
Q12

                                    book  year_published  amazon_rating
0                       The Way of Kings            2010            5.0
1                      A Game of Thrones            1996            4.5
2                             The Hobbit            1937            5.0
3  Harry Potter and the Sorcerer's Stone            1997            5.0
4  The Lion, the Witch, and the Wardrobe            1950            5.0

In [16]:
import pandas as pd
pop = {'Nevada':{2001: 2.4, 2002: 2.9},
      'Ohio': {2000:1.5, 2001: 1.7, 2002: 3.6}}

Q13 = pd.DataFrame(pop)
Q13

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [19]:
Q14 = Q13.T
Q14

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [20]:
Q15 = Q14.reindex(columns=[2000,2001,2002])
Q15

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [23]:
Q16 = Q15.loc['Nevada']
Q16

2000    NaN
2001    2.4
2002    2.9
Name: Nevada, dtype: float64

**Q17:** Select the `2001` column from the `Q15` DataFrame and save this as `Q17`.

In [24]:
Q17 = Q15[2001]
Q17

Nevada    2.4
Ohio      1.7
Name: 2001, dtype: float64

**Q18:**  Select the `Ohio` row and the `2001` and `2002` columns from `Q15` and save this as `Q18`.

In [25]:
Q18 = Q15.loc['Ohio',[2001,2002]]
Q18

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [26]:
table =  {'name': ['John', 'Jane', 'Billy', 'Tracy'],
         'age': [25, 27, 42, 31],
          'gender': ['M','F','M','F'],
         'profession': ['Developer', 'Analyst', 'Admin', 'Data Scientist'],
         'salary':[100000, 80000, 75000, 110000]
         }

employees = pd.DataFrame(table)
employees

    name  age gender      profession  salary
0   John   25      M       Developer  100000
1   Jane   27      F         Analyst   80000
2  Billy   42      M           Admin   75000
3  Tracy   31      F  Data Scientist  110000

In [27]:
Q19 = employees[employees['salary'] > 90000]

In [28]:
Q20 = employees[employees['salary'] < 90000]['name']
Q20

1     Jane
2    Billy
Name: name, dtype: object

In [29]:
Q21 = employees[(employees['salary'] < 90000) & (employees['age'] > 30)]['name']

In [30]:
new_hires = {'name': ['Emily','Lukas','Janelle'],
            'age': [22, np.nan, 52],
             'gender': ['F','M','F'],
            'profession': ['Project Manager','ML Engineer','CIO'],
            'salary': [np.nan,135000,230000]}

DF = pd.DataFrame(new_hires)
Q22 = pd.concat([employees, DF], ignore_index=True)
Q22

      name   age gender       profession    salary
0     John  25.0      M        Developer  100000.0
1     Jane  27.0      F          Analyst   80000.0
2    Billy  42.0      M            Admin   75000.0
3    Tracy  31.0      F   Data Scientist  110000.0
4    Emily  22.0      F  Project Manager       NaN
5    Lukas   NaN      M      ML Engineer  135000.0
6  Janelle  52.0      F              CIO  230000.0

**Q23:**  Create a copy of `Q22` and save it as `Q23`.  Drop all rows that contain missing values from the `Q23` DataFrame.

In [31]:
Q23 = Q22.copy()

Q23 = Q23.dropna()
Q23

      name   age gender      profession    salary
0     John  25.0      M       Developer  100000.0
1     Jane  27.0      F         Analyst   80000.0
2    Billy  42.0      M           Admin   75000.0
3    Tracy  31.0      F  Data Scientist  110000.0
6  Janelle  52.0      F             CIO  230000.0

In [32]:
departments = ['IT','IT','Administration','IT','Communications','IT','Executive']

Q24 = Q22.copy()

Q24['departments'] = departments

In [33]:
Q25 = Q24.copy()

min = Q25['salary'].min()

Q25['salary'] = Q25['salary'].fillna((Q25['salary'].min()))
Q25

      name   age gender       profession    salary     departments
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
3    Tracy  31.0      F   Data Scientist  110000.0              IT
4    Emily  22.0      F  Project Manager   75000.0  Communications
5    Lukas   NaN      M      ML Engineer  135000.0              IT
6  Janelle  52.0      F              CIO  230000.0       Executive

**Q26:** Make a copy of `Q25` and save it as `Q26`.  Add Lukas' age of `54` to the `Q26` DataFrame.

In [34]:
Q26 = Q25.copy()

Q26.loc[Q26['name'] == 'Lukas', 'age'] = 54

Q26

      name   age gender       profession    salary     departments
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
3    Tracy  31.0      F   Data Scientist  110000.0              IT
4    Emily  22.0      F  Project Manager   75000.0  Communications
5    Lukas  54.0      M      ML Engineer  135000.0              IT
6  Janelle  52.0      F              CIO  230000.0       Executive

In [35]:
Q27 = Q26.sort_values(by='age')
Q27

      name   age gender       profession    salary     departments
4    Emily  22.0      F  Project Manager   75000.0  Communications
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
3    Tracy  31.0      F   Data Scientist  110000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
6  Janelle  52.0      F              CIO  230000.0       Executive
5    Lukas  54.0      M      ML Engineer  135000.0              IT

In [36]:
Q28 = Q26.sort_values(by='salary', ascending=False)
Q28

      name   age gender       profession    salary     departments
6  Janelle  52.0      F              CIO  230000.0       Executive
5    Lukas  54.0      M      ML Engineer  135000.0              IT
3    Tracy  31.0      F   Data Scientist  110000.0              IT
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
4    Emily  22.0      F  Project Manager   75000.0  Communications

In [37]:
department = Q28['departments']
Q29 = department.value_counts()
Q29

departments
IT                4
Executive         1
Administration    1
Communications    1
Name: count, dtype: int64

In [38]:
Q30 = Q28.copy()

Q30 = Q30.rename(columns={'name':'employee_name'})
Q30

  employee_name   age gender       profession    salary     departments
6       Janelle  52.0      F              CIO  230000.0       Executive
5         Lukas  54.0      M      ML Engineer  135000.0              IT
3         Tracy  31.0      F   Data Scientist  110000.0              IT
0          John  25.0      M        Developer  100000.0              IT
1          Jane  27.0      F          Analyst   80000.0              IT
2         Billy  42.0      M            Admin   75000.0  Administration
4         Emily  22.0      F  Project Manager   75000.0  Communications